Полный и несокращенный словарь синонимов.

*Быстрый динамический поиск слов, в то время как Вы печатаете
*Транскрипция, облегчающая произношение
*Гиперссылки между различными связанными словами
*История, чтобы видеть последние 50 слов которые Вы искали
*Поддержка карта памяти
*Фильтры, чтобы помочь Вам определить местонахождение слова, которую Вы ищете:
*Нечеткий фильтр - использовается, когда Вы не уверены в правильном правописании слова
*Виджет
*Способность искать слова в установленных словарях через стандартную телефонную функцию поиска
*Еще много других функций

Информация взята из: http://4pda.ru/forum/index.php?showtopic=205564&st=20#entry13460060